; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v8 - type_2 ?v1 - type_1)
 	      (pred_2 ?v3 - object ?v1 - type_1)
	      (pred_3 ?v8 - type_2 ?v5 - type_3)
	      (pred_1 ?v8 - type_2 ?v3 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v8 - type_2 ?v4 ?v2 - type_1)
       :precondition (and  (pred_4 ?v8 ?v4))
       :effect (and  (pred_4 ?v8 ?v2)
		     (not (pred_4 ?v8 ?v4))))

   (:action op_1
       :parameters (?v8 - type_2 ?v6 - object ?v7 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v7) (pred_4 ?v8 ?v7) (pred_3 ?v8 ?v5))
       :effect (and (pred_1 ?v8 ?v6 ?v5)
		    (not (pred_2 ?v6 ?v7)) 
		    (not (pred_3 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_2 ?v6 - object ?v7 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v6 ?v5) (pred_4 ?v8 ?v7))
       :effect (and (pred_2 ?v6 ?v7)
		    (pred_3 ?v8 ?v5)
		    (not (pred_1 ?v8 ?v6 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_2
obj_04 obj_03 - type_3
obj_07 obj_08 obj_01 - type_1
obj_02 obj_09 obj_05 - object)
(:init
(pred_4 obj_06 obj_07)
(pred_3 obj_06 obj_04)
(pred_3 obj_06 obj_03)
(pred_2 obj_02 obj_07)
(pred_2 obj_09 obj_08)
(pred_2 obj_05 obj_08)
)
(:goal
(and
(pred_2 obj_02 obj_08)
(pred_2 obj_09 obj_01)
(pred_2 obj_05 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_06 ?b obj_03))))
)
)

; plan
1. (op_1 obj_06 obj_02 obj_07 obj_04)
   deleted: (pred_2 obj_02 obj_07) (pred_3 obj_06 obj_04)
   added: (pred_1 obj_06 obj_02 obj_04)
   goals met: 0 of 3
2. (op_2 obj_06 obj_07 obj_08)
   deleted: (pred_4 obj_06 obj_07)
   added: (pred_4 obj_06 obj_08)
   goals met: 0 of 3
3. (op_3 obj_06 obj_02 obj_08 obj_04)
   deleted: (pred_1 obj_06 obj_02 obj_04)
   added: (pred_2 obj_02 obj_08) (pred_3 obj_06 obj_04)
   goals met: 1 of 3
4. (op_1 obj_06 obj_09 obj_08 obj_04)
   deleted: (pred_2 obj_09 obj_08) (pred_3 obj_06 obj_04)
   added: (pred_1 obj_06 obj_09 obj_04)
   goals met: 1 of 3
5. (op_2 obj_06 obj_08 obj_01)
   deleted: (pred_4 obj_06 obj_08)
   added: (pred_4 obj_06 obj_01)
   goals met: 1 of 3
6. (op_3 obj_06 obj_09 obj_01 obj_04)
   deleted: (pred_1 obj_06 obj_09 obj_04)
   added: (pred_2 obj_09 obj_01) (pred_3 obj_06 obj_04)
   goals met: 2 of 3
7. (op_2 obj_06 obj_01 obj_08)
   deleted: (pred_4 obj_06 obj_01)
   added: (pred_4 obj_06 obj_08)
   goals met: 2 of 3
8. (op_1 obj_06 obj_05 obj_08 obj_04)
   deleted: (pred_2 obj_05 obj_08) (pred_3 obj_06 obj_04)
   added: (pred_1 obj_06 obj_05 obj_04)
   goals met: 2 of 3
9. (op_2 obj_06 obj_08 obj_07)
   deleted: (pred_4 obj_06 obj_08)
   added: (pred_4 obj_06 obj_07)
   goals met: 2 of 3
10. (op_3 obj_06 obj_05 obj_07 obj_04)
   deleted: (pred_1 obj_06 obj_05 obj_04)
   added: (pred_2 obj_05 obj_07) (pred_3 obj_06 obj_04)
   goals met: 3 of 3
